results/idempotency-2026-07-31_06-41-00.txt
     ✓ submission 1 -> not 5xx
     ✓ submission 2 (duplicate) -> not 5xx
     ✓ at least one duplicate submission accepted
     ✓ job 0226b6fc-83a2-4dd5-9349-d42a6764b9cf reached terminal state (no hang)
     ✓ job 6974a7d3-ee64-4217-b3ea-e8aa0655ec83 reached terminal state (no hang)

   ✓ checks.........................: 100.00% ✓ 5        ✗ 0  
     data_received..................: 10 kB   1.0 kB/s
     data_sent......................: 2.9 kB  300 B/s
     http_req_blocked...............: avg=30.23ms  min=0s      med=0s      max=151.15ms p(90)=90.69ms  p(95)=120.92ms
     http_req_connecting............: avg=3.88ms   min=0s      med=0s      max=19.42ms  p(90)=11.65ms  p(95)=15.53ms 
     http_req_duration..............: avg=114.42ms min=84.45ms med=92.58ms max=176.34ms p(90)=158.85ms p(95)=167.59ms
       { expected_response:true }...: avg=114.42ms min=84.45ms med=92.58ms max=176.34ms p(90)=158.85ms p(95)=167.59ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 5  
     http_req_receiving.............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_sending...............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=26.08ms  min=0s      med=0s      max=130.43ms p(90)=78.25ms  p(95)=104.34ms
     http_req_waiting...............: avg=114.42ms min=84.45ms med=92.58ms max=176.34ms p(90)=158.85ms p(95)=167.59ms
     http_reqs......................: 5       0.513831/s
     iteration_duration.............: avg=9.73s    min=9.73s   med=9.73s   max=9.73s    p(90)=9.73s    p(95)=9.73s   
     iterations.....................: 1       0.102766/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1