results/robustness-2026-07-31_06-48-49.txt
     ✓ [corrupt_header] create accepted or cleanly rejected
     ✓ [corrupt_header] reached terminal state (no hang)
     ✓ [truncated] create accepted or cleanly rejected
     ✓ [truncated] reached terminal state (no hang)
     ✓ [garbage_bytes] create accepted or cleanly rejected
     ✓ [garbage_bytes] reached terminal state (no hang)
     ✓ [empty_file] create accepted or cleanly rejected
     ✓ [empty_file] reached terminal state (no hang)
     ✓ [content_type_mismatch] create accepted or cleanly rejected
     ✓ [content_type_mismatch] reached terminal state (no hang)
     ✓ [oversized] create accepted or cleanly rejected
     ✗ [oversized] reached terminal state (no hang)
      ↳  0% — ✓ 0 / ✗ 1
     ✓ [blank_no_text] create accepted or cleanly rejected
     ✓ [blank_no_text] reached terminal state (no hang)
     ✓ [many_pages] create accepted or cleanly rejected
     ✓ [many_pages] reached terminal state (no hang)
     ✓ [encrypted] create accepted or cleanly rejected
     ✓ [encrypted] reached terminal state (no hang)

     checks.........................: 94.44% ✓ 17       ✗ 1  
     data_received..................: 107 kB 241 B/s
     data_sent......................: 36 kB  80 B/s
     http_req_blocked...............: avg=661.82µs min=0s      med=0s      max=56.44ms p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=128.23µs min=0s      med=0s      max=9.93ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=55.1ms   min=33.62ms med=43.54ms max=227.8ms p(90)=92.2ms   p(95)=105.06ms
       { expected_response:true }...: avg=55.1ms   min=33.62ms med=43.54ms max=227.8ms p(90)=92.2ms   p(95)=105.06ms
     http_req_failed................: 0.00%  ✓ 0        ✗ 154
     http_req_receiving.............: avg=143.14µs min=0s      med=0s      max=1.56ms  p(90)=529.31µs p(95)=1.02ms  
     http_req_sending...............: avg=32.31µs  min=0s      med=0s      max=3.83ms  p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=443.79µs min=0s      med=0s      max=34.99ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=54.92ms  min=33.62ms med=43.17ms max=227.8ms p(90)=92.07ms  p(95)=104.8ms 
     http_reqs......................: 154    0.347107/s
     iteration_duration.............: avg=49.29s   min=3.11s   med=6.24s   max=5m2s    p(90)=2m11s    p(95)=3m36s   
     iterations.....................: 9      0.020286/s
     robustness_failed..............: 5      0.01127/s
   ✗ robustness_hang................: 11.11% ✓ 1        ✗ 8  
     robustness_success.............: 3      0.006762/s
     vus............................: 1      min=1      max=1
     vus_max........................: 1      min=1      max=1